# hw05_06
students = [student for student in range(1, 11)]

while students:
    print('未簽到座號:', end=' ')
    for student in students:
        print(student, end=' ')
    checkin = int(input('\n請輸入座號(1~10): '))
    students.remove(checkin)

print('未簽到座號: 沒有，全員到齊!')


'''

未簽到座號: 1 2 3 4 5 6 7 8 9 10 
請輸入座號(1~10): 3
未簽到座號: 1 2 4 5 6 7 8 9 10 
請輸入座號(1~10): 4
未簽到座號: 1 2 5 6 7 8 9 10 
請輸入座號(1~10): 5
未簽到座號: 1 2 6 7 8 9 10 
請輸入座號(1~10): 1
未簽到座號: 2 6 7 8 9 10 
請輸入座號(1~10): 2
未簽到座號: 6 7 8 9 10
請輸入座號(1~10): 10
未簽到座號: 6 7 8 9
請輸入座號(1~10): 9
未簽到座號: 6 7 8
請輸入座號(1~10): 6
未簽到座號: 7 8
請輸入座號(1~10): 7
未簽到座號: 8
請輸入座號(1~10): 8
未簽到座號: 沒有，全員到齊!

'''
